Revit 2027 API
CurveElement.CenterPointReference Property
Centerpoint reference of curve element. Curves such as circles, arcs, ellipses, and partial ellipses support this property.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference CenterPointReference { get; }
Public ReadOnly Property CenterPointReference As Reference
	Get
public:
property Reference^ CenterPointReference {
	Reference^ get ();
}
member CenterPointReference : Reference with get
Property Value
Reference
Remarks
Use this reference property when using the API to dimension between centerpoints of curves.
See Also
Reference
CurveElement Class
Autodesk.Revit.DB Namespace